### Задание 4.
Напишите функцию, которая принимает DataFrame и заменяет отсутствующие значения (NaN) в каждом числовом столбце на более подходящие значения (здесь стоит использовать группировки по нескольким столбцам, чтобы получить наиболее реалистичные данные). Если столбец содержит только NaN, оставьте его без изменений.

In [ ]:
import pandas as pd

data = {
    'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai', 'Manchester', 'Cairo', 'Osaka'],
    'sex': ['M', 'F', 'F', 'M', 'F', 'M', 'M'],
    'age': [41, None, 33, 34, None, 31, 37],
    'height': [178, 164, 172, None, None, 180, 195],
    'weight': [80, 52, None, 61, 62, 73, None],
    'score': [None, None, None, None, None, None, None],
}

df = pd.DataFrame(data)
df

     name         city sex   age  height  weight score
0  Xavier  Mexico City   M  41.0   178.0    80.0  None
1     Ann      Toronto   F   NaN   164.0    52.0  None
2    Jana       Prague   F  33.0   172.0     NaN  None
3      Yi     Shanghai   M  34.0     NaN    61.0  None
4   Robin   Manchester   F   NaN     NaN    62.0  None

In [53]:
df.dtypes

name       object
city       object
sex        object
age       float64
height    float64
weight    float64
score      object
dtype: object

In [ ]:
# Скопируем изначальный датафрейм
df_copy = df.copy()

# Ищем целочисленные столбцы
numeric_cols = df_copy.select_dtypes('number').columns
numeric_cols

Index(['age', 'height', 'weight'], dtype='object')

**Решение 1** - без группировки

Заполним пустые значения **средними значениями** по столбцу. 

Вместо функции `mean` можно использовать, например, `median` или `mode` в зависимости от того, что больше подходит.

In [ ]:
df_copy[numeric_cols] = df_copy[numeric_cols].fillna(df_copy[numeric_cols].mean())
df_copy

     name         city sex   age  height  weight score
0  Xavier  Mexico City   M  41.0   178.0    80.0  None
1     Ann      Toronto   F  35.2   164.0    52.0  None
2    Jana       Prague   F  33.0   172.0    65.6  None
3      Yi     Shanghai   M  34.0   177.8    61.0  None
4   Robin   Manchester   F  35.2   177.8    62.0  None
5    Amal        Cairo   M  31.0   180.0    73.0  None
6    Nori        Osaka   M  37.0   195.0    65.6  None

**Решение 2** - с группировкой по списку, переданному в функцию

In [72]:
# Введем столбцы для группировки
group_cols = ['sex']

# Скопируем изначальный датафрейм еще раз
df_copy = df.copy()

Заполняем пустые ячейки средними значениями, используя группировку по столбцам `group_cols`.

Рашифровка строчки: 
1. Группируем по столбцам `group_cols`, 
2. Для каждой группы и соответствующего столбца из `numeric_cols` вычисляем среднее (применяем `'mean'` с помощью `transform()`), 
3. Заполняем пустые значения в столбцах `numeric_cols` этим средним значением

In [73]:
df_copy[numeric_cols] = df_copy[numeric_cols].fillna(df_copy.groupby(group_cols)[numeric_cols].transform('mean'))
df_copy

     name         city sex   age      height     weight score
0  Xavier  Mexico City   M  41.0  178.000000  80.000000  None
1     Ann      Toronto   F  33.0  164.000000  52.000000  None
2    Jana       Prague   F  33.0  172.000000  57.000000  None
3      Yi     Shanghai   M  34.0  184.333333  61.000000  None
4   Robin   Manchester   F  33.0  168.000000  62.000000  None
5    Amal        Cairo   M  31.0  180.000000  73.000000  None
6    Nori        Osaka   M  37.0  195.000000  71.333333  None